
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       3 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                 |
|:--------:|:--------------------------------------------------------------------------|
|    🟢     | `module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]` |
|    🟢     | `module.repos["infrahouse-com"].github_repository.repo`                   |
|    🟢     | `module.repos["infrahouse-com"].github_team_repository.dev`               |
|    🟢     | `github_organization_settings.infrahouse:`                                |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/6447bf4e-c152-4e57-b5fc-262e369f99ca/terraform-bin plan -var-file=configuration.tfvars -no-color --out=tf.plan
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
data.external.env: Reading...
module.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
data.external.env: Read complete after 0s [id=-]
module.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
github_team_members.dev: Refreshing state... [id=7332815]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
module.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]
data.aws_secretsmanager_secrets.gh_secrets: Reading...
data.aws_ssm_parameter.gh_secrets_namespace: Reading...
data.aws_ssm_parameter.gh_secrets_namespace: Read complete after 1s [id=gh_secrets_namespace]
aws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]
module.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]
data.aws_secretsmanager_secrets.gh_secrets: Read complete after 1s [id=us-west-1]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
data.aws_secretsmanager_secret_version.codacy_api_token: Reading...
data.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]
module.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]
module.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]
module.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]
module.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]
module.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]
module.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]
module.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]
module.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]
module.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]
module.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]
module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]
module.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]
module.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]
module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=github-control:AWS_DEFAULT_REGION]
module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=github-control:AWS_ROLE]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-s3-control:AWS_DEFAULT_REGION]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=aws-s3-control:AWS_ROLE]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-s3-control:GH_TOKEN]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
module.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]
module.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]
module.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]
module.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]
module.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]
module.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]
module.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]
module.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]
module.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]
module.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]
module.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]
module.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]
module.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]
module.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]
module.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]
module.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]
module.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]
module.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]
module.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]
module.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]
module.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]
module.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]
module.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]
module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]
module.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]
module.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]
module.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]
module.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]
module.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]
module.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "infrahouse-com"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.repos["infrahouse-com"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "InfraHouse.com content"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "infrahouse-com"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
    }

  # module.repos["infrahouse-com"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "infrahouse-com"
      + team_id    = "7332815"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: github_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Adata.external.env: Reading...%0Amodule.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Adata.external.env: Read complete after 0s [id=-]%0Amodule.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]%0Adata.aws_secretsmanager_secrets.gh_secrets: Reading...%0Adata.aws_ssm_parameter.gh_secrets_namespace: Reading...%0Adata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 1s [id=gh_secrets_namespace]%0Aaws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]%0Amodule.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]%0Adata.aws_secretsmanager_secrets.gh_secrets: Read complete after 1s [id=us-west-1]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]%0Amodule.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]%0Amodule.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]%0Amodule.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]%0Amodule.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]%0Amodule.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]%0Amodule.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]%0Amodule.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]%0Amodule.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=github-control:AWS_DEFAULT_REGION]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=github-control:AWS_ROLE]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-s3-control:AWS_DEFAULT_REGION]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=aws-s3-control:AWS_ROLE]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-s3-control:GH_TOKEN]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]%0Amodule.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]%0Amodule.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]%0Amodule.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]%0Amodule.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]%0Amodule.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]%0Amodule.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]%0Amodule.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]%0Amodule.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]%0Amodule.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]%0Amodule.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]%0Amodule.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]%0Amodule.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]%0Amodule.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]%0Amodule.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]%0Amodule.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]%0Amodule.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]%0Amodule.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "infrahouse-com"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.repos["infrahouse-com"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "InfraHouse.com content"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "infrahouse-com"%0A      + node_id                     = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + visibility                  = "public"%0A    }%0A%0A  # module.repos["infrahouse-com"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "infrahouse-com"%0A      + team_id    = "7332815"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvNjQ0N2JmNGUtYzE1Mi00ZTU3LWI1ZmMtMjYyZTM2OWY5OWNhL3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLW5vLWNvbG9yIC0tb3V0PXRmLnBsYW5cbmdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXVxuZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV1cbmdpdGh1Yl90ZWFtLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cbmRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkaW5nLi4uXG5tb2R1bGUuaWhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVxuZGF0YS5leHRlcm5hbC5lbnY6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPS1dXG5tb2R1bGUuaWg4X3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV1cbmdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVxubW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cbm1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2xdXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWdoX3NlY3JldHNfbmFtZXNwYWNlXVxuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5jb2RhY3lfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fQ09EQUNZX1BST0pFQ1RfVE9LRU4tZmhsT1MyXVxuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLTVOOFV0R11cbm1vZHVsZS5paF90Zl90ZW1wbGF0ZS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tdGVtcGxhdGVdXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPXVzLXdlc3QtMV1cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5jb2RhY3lfYXBpX3Rva2VuOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5jb2RhY3lfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fQ09EQUNZX1BST0pFQ1RfVE9LRU4tZmhsT1MyfEFXU0NVUlJFTlRdXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLTVOOFV0R3xBV1NDVVJSRU5UXVxubW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXVxubW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wcm94eXNxbC1zYW5kYm94XVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZF1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pblwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZV1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdXG5tb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZV1cbm1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVxubW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOmFrdXptaW5za3ldXG5tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dXG5tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cbm1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpha3V6bWluc2t5XVxubW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dXG5tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfUk9MRVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6QVdTX1JPTEVdXG5tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ST0xFXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpBV1NfUk9MRV1cbm1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpHSF9UT0tFTl1cbm1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uLm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUJQUl9rd0RPSTJ2dTdNNENBaWNpXVxubW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9KQ2VpVWM0Q0VadlFdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtdG9vbGtpdF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XVxubW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6cHVwcGV0LWNvZGVdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZF1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC00OTMzNzA4MjY0MjRdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJdXG5tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVxubW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwcm94eXNxbC1zYW5kYm94XVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNDpBV1NfREVGQVVMVF9SRUdJT05dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNzpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfREVGQVVMVF9SRUdJT05dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwbzpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naGEtYWRtaW46R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXByb3h5c3FsLXNhbmRib3g6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29yazpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGU6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0OkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQ09EQUNZX1BST0pFQ1RfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpDT0RBQ1lfUFJPSkVDVF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiUFlQSV9BUElfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpQWVBJX0FQSV9UT0tFTl1cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICArIGNyZWF0ZVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIge1xuICAgICAgKyBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSlcbiAgICAgICsgcmVwb3NpdG9yeSAgICAgID0gXCJpbmZyYWhvdXNlLWNvbVwiXG4gICAgICArIHNlY3JldF9uYW1lICAgICA9IFwiR0hfVE9LRU5cIlxuICAgICAgKyB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgKyBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgICsgYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiSW5mcmFIb3VzZS5jb20gY29udGVudFwiXG4gICAgICArIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZnVsbF9uYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGhhc19pc3N1ZXMgICAgICAgICAgICAgICAgICA9IHRydWVcbiAgICAgICsgaHRtbF91cmwgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWVyZ2VfY29tbWl0X21lc3NhZ2UgICAgICAgID0gXCJQUl9USVRMRVwiXG4gICAgICArIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1jb21cIlxuICAgICAgKyBub2RlX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaXZhdGUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVwb19pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2UgPSBcIkNPTU1JVF9NRVNTQUdFU1wiXG4gICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCJcbiAgICAgICsgc3NoX2Nsb25lX3VybCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdm5fdXJsICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHZpc2liaWxpdHkgICAgICAgICAgICAgICAgICA9IFwicHVibGljXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWNvbVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldiB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl90ZWFtX3JlcG9zaXRvcnlcIiBcImRldlwiIHtcbiAgICAgICsgZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGVybWlzc2lvbiA9IFwicHVzaFwiXG4gICAgICArIHJlcG9zaXRvcnkgPSBcImluZnJhaG91c2UtY29tXCJcbiAgICAgICsgdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiXG4gICAgfVxuXG5QbGFuOiAzIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS5cblxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdJTBBZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV0lMEFnaXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdJTBBZGF0YS5leHRlcm5hbC5lbnY6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXSUwQWRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0tXSUwQW1vZHVsZS5paDhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXSUwQWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9Z2hfc2VjcmV0c19uYW1lc3BhY2VdJTBBYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5jb2RhY3lfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fQ09EQUNZX1BST0pFQ1RfVE9LRU4tZmhsT1MyXSUwQWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi01TjhVdEddJTBBbW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS10ZW1wbGF0ZV0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPXVzLXdlc3QtMV0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLiUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmNvZGFjeV9hcGlfdG9rZW46IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5jb2RhY3lfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fQ09EQUNZX1BST0pFQ1RfVE9LRU4tZmhsT1MyfEFXU0NVUlJFTlRdJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi01TjhVdEd8QVdTQ1VSUkVOVF0lMEFtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXSUwQW1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHJveHlzcWwtc2FuZGJveF0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2xdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0XSUwQW1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpha3V6bWluc2t5XSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpHSF9UT0tFTl0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2w6YWt1em1pbnNreV0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfUk9MRVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6QVdTX1JPTEVdJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX1JPTEVcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOkFXU19ST0xFXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpHSF9UT0tFTl0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0pDZWlVYzRDRVp2UV0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtdG9vbGtpdF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRdJTBBbW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6cHVwcGV0LWNvZGVdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2xdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXSUwQW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwcm94eXNxbC1zYW5kYm94XSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQ6QVdTX0RFRkFVTFRfUkVHSU9OXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDc6QVdTX0RFRkFVTFRfUkVHSU9OXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNzpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwbzpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pblwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZTpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6QVdTX0RFRkFVTFRfUkVHSU9OXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wcm94eXNxbC1zYW5kYm94OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcms6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZTpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQ09EQUNZX1BST0pFQ1RfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpDT0RBQ1lfUFJPSkVDVF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIlBZUElfQVBJX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHslMEEgICAgICArIGNyZWF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgKyByZXBvc2l0b3J5ICAgICAgPSBcImluZnJhaG91c2UtY29tXCIlMEEgICAgICArIHNlY3JldF9uYW1lICAgICA9IFwiR0hfVE9LRU5cIiUwQSAgICAgICsgdXBkYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7JTBBICAgICAgKyBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYXJjaGl2ZWQgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIkluZnJhSG91c2UuY29tIGNvbnRlbnRcIiUwQSAgICAgICsgZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZnVsbF9uYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZ2l0X2Nsb25lX3VybCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaGFzX2lzc3VlcyAgICAgICAgICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgaHRtbF91cmwgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaHR0cF9jbG9uZV91cmwgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWVyZ2VfY29tbWl0X21lc3NhZ2UgICAgICAgID0gXCJQUl9USVRMRVwiJTBBICAgICAgKyBtZXJnZV9jb21taXRfdGl0bGUgICAgICAgICAgPSBcIk1FUkdFX01FU1NBR0VcIiUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWNvbVwiJTBBICAgICAgKyBub2RlX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXBvX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2UgPSBcIkNPTU1JVF9NRVNTQUdFU1wiJTBBICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiJTBBICAgICAgKyBzc2hfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdm5fdXJsICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB2aXNpYmlsaXR5ICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIgeyUwQSAgICAgICsgZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwZXJtaXNzaW9uID0gXCJwdXNoXCIlMEEgICAgICArIHJlcG9zaXRvcnkgPSBcImluZnJhaG91c2UtY29tXCIlMEEgICAgICArIHRlYW1faWQgICAgPSBcIjczMzI4MTVcIiUwQSAgICB9JTBBJTBBUGxhbjogMyB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDMsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>